## Pandas 학습

### 라이브러리 추가

```python
!pip install pandas
```

In [74]:
!pip install pandas

Requirement already satisfied: pandas in c:\dev\python312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\dev\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\dev\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\dev\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### Pandas 라이브러리 로딩
```python
import pandas as pd
```

### Pandas 기본
#### DataFrame 객체
- 파이썬 2차원 리스트(배열)와 동일
- 행(row) 각 하나의 유니크 데이터 묶음
- 열(column) 유니크 데이터의 하나하나 특성

In [75]:
import pandas as pd

In [76]:
## 2차원 딕셔너리 생성
data = {'이름':['ㅇㅇㅇ','ㅁㅁㅁ'], '나이':[24,25], '주소':['ㅇㅇ','ㅁㅁ'], '이메일':['ㅇㅇ','ㅁㅁ'], '결혼':[True,False]}
df = pd.DataFrame(data=data)
df

    이름  나이  주소 이메일     결혼
0  ㅇㅇㅇ  24  ㅇㅇ  ㅇㅇ   True
1  ㅁㅁㅁ  25  ㅁㅁ  ㅁㅁ  False

In [77]:
## 2차원 리스트 생성
data = [['ㅇㅇㅇ', 20, 'ㅁㅁ', 'ㅇㅇㅇ@naver.com', True], ['ㅂㅂㅂ', 30, 'ㅋㅋ', 'ㅂㅂㅂ@naver.com', False],
        ['ㅅㅅㅅ', 20, 'ㄱㄱ', 'ㅅㅅㅅ@naver.com', True], ['ㄷㄷㄷ', 25, 'ㄹㄹ', 'ㄷㄷㄷ@naver.com', False]]

data

[['ㅇㅇㅇ', 20, 'ㅁㅁ', 'ㅇㅇㅇ@naver.com', True],
 ['ㅂㅂㅂ', 30, 'ㅋㅋ', 'ㅂㅂㅂ@naver.com', False],
 ['ㅅㅅㅅ', 20, 'ㄱㄱ', 'ㅅㅅㅅ@naver.com', True],
 ['ㄷㄷㄷ', 25, 'ㄹㄹ', 'ㄷㄷㄷ@naver.com', False]]

In [78]:
## 2차원 리스트로 DataFrame 객체 생성
df = pd.DataFrame(data=data, columns=['이름', '나이', '주소', '이메일', '결혼'])
df

    이름  나이  주소            이메일     결혼
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com   True
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com  False
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com   True
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  False

In [79]:
## 데이터프레임에서 데이터 조회(열) - 리스트는 for문을 써야 출력가능
df['이름']

0    ㅇㅇㅇ
1    ㅂㅂㅂ
2    ㅅㅅㅅ
3    ㄷㄷㄷ
Name: 이름, dtype: object

In [80]:
## 데이터프레임 조회 (2개 열)
df[['이름','나이']]

    이름  나이
0  ㅇㅇㅇ  20
1  ㅂㅂㅂ  30
2  ㅅㅅㅅ  20
3  ㄷㄷㄷ  25

In [81]:
## 데이터프레임 행으로 조회
df.loc[0]

이름               ㅇㅇㅇ
나이                20
주소                ㅁㅁ
이메일    ㅇㅇㅇ@naver.com
결혼              True
Name: 0, dtype: object

In [82]:
## 데이터프레임 조회(행)
df.loc[[1, 3]]

    이름  나이  주소            이메일     결혼
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com  False
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  False

In [83]:
# 현재 데이터프레임 확인
df

    이름  나이  주소            이메일     결혼
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com   True
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com  False
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com   True
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  False

In [84]:
## 새 컬럼 추가
df['전번'] = ['010', '02', '011', '051']

In [85]:
# 추가 데이터프레임 확인
df

    이름  나이  주소            이메일     결혼   전번
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com   True  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com  False   02
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com   True  011
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  False  051

In [86]:
## 열 삭제, axis=0(행), 1(열)
df.drop('결혼', axis=1)

    이름  나이  주소            이메일   전번
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com  011
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  051

In [87]:
## drop()은 삭제하고 출력만 해줌. 완전히 삭제하려면 inplace 옵션을 사용
# inplace를 화면에 출력안됨
df.drop('결혼', axis=1, inplace=True)

In [88]:
# 삭제확인
df

    이름  나이  주소            이메일   전번
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com  011
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  051

In [89]:
## 행 추가
df.loc[4] = ['손흥민', 32, '런던', 'shm@gmail.com', '020']

In [90]:
df

    이름  나이  주소            이메일   전번
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com  011
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  051
4  손흥민  32  런던  shm@gmail.com  020

In [91]:
## 행 삭제할 때, 완전히 지우려면 inplace를 쓰거나 변수에 재할당
df2 = df.drop(3)

In [92]:
df2

    이름  나이  주소            이메일   전번
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
2  ㅅㅅㅅ  20  ㄱㄱ  ㅅㅅㅅ@naver.com  011
4  손흥민  32  런던  shm@gmail.com  020

In [93]:
## 행 삭제 = inplace, 행 삭제 시는 axis=0만 사용 또는 생략
df.drop(2, axis=0, inplace=True)

In [94]:
df

    이름  나이  주소            이메일   전번
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  051
4  손흥민  32  런던  shm@gmail.com  020

In [95]:
## 열 이름을 변경
df.rename(columns={'전번':'휴대폰'}, inplace=True)

In [96]:
df

    이름  나이  주소            이메일  휴대폰
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  051
4  손흥민  32  런던  shm@gmail.com  020

- 데이터프레임은 파이썬의 2차원 리스트와 동일하지만, 좀더 사용하기 쉽게 만든 클래스

#### 시리즈 객체

- 파이썬에서 1차원 리스트(배열)
- 시리즈들 그루핑한게 데이터프레임
- 가장 최소단위

In [97]:
data = [20, 30, 20, 25, 32]
srs = pd.Series(data=data)
srs

0    20
1    30
2    20
3    25
4    32
dtype: int64

In [98]:
type(srs)

pandas.core.series.Series

In [99]:
srs = pd.Series(data=data, index=['ㅇㅇㅇ','ㅂㅂㅂ','ㅅㅅㅅ','ㄷㄷㄷ','손흥민'])
srs

ㅇㅇㅇ    20
ㅂㅂㅂ    30
ㅅㅅㅅ    20
ㄷㄷㄷ    25
손흥민    32
dtype: int64

In [100]:
## 조회
srs['손흥민']

32

In [101]:
## 값 변경
srs['ㅇㅇㅇ'] = 18

In [102]:
srs

ㅇㅇㅇ    18
ㅂㅂㅂ    30
ㅅㅅㅅ    20
ㄷㄷㄷ    25
손흥민    32
dtype: int64

In [103]:
## 데이터프레임에서 한 행을 가져와도 시리즈
df.loc[1]

이름               ㅂㅂㅂ
나이                30
주소                ㅋㅋ
이메일    ㅂㅂㅂ@naver.com
휴대폰               02
Name: 1, dtype: object

#### 데이터프레임 사용하기

- CSV, 엑셀파일 로드
- VS Code 플러그인, GrapeCity의 Excel Viewer를 설치

In [104]:
## CSV 로드
df_csv = pd.read_csv('./data/sample_1.csv', encoding='utf-8', header=1, skipfooter=2, engine='python' ,usecols=[0,1,2])
df_csv

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [105]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\dev\python312\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\dev\python312\lib\site-packages (from openpyxl) (1.1.0)

In [106]:
# 엑셀 로드
df_xls = pd.read_excel('./data/sample_1.xlsx', header=1, skipfooter=2, usecols='A:C', sheet_name='Sheet1')
df_xls

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [107]:
## DF 정보확인
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [108]:
## 데이터 일부 보기(위에서 부터 5개 기본)
df_csv.head(n=3)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319

In [109]:
## 데이터 일부 보기(아래에서부터 n=5)
df_csv.tail(n=3)

  국적코드  성별    입국객수
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [110]:
## 통계량 요약해서 보기
df_csv.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [111]:
df_csv['기준년월'] = ['2023-10', '2023-11', '2023-12', '2024-01','2024-02','2024-03']

In [113]:
df_csv

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-10
1  A01  여성  191436  2023-11
2  A31  남성     319  2023-12
3  A31  여성      42  2024-01
4  A18  남성  158912  2024-02
5  A18  여성  232943  2024-03

In [114]:
df_csv['기준년월'] = '2023-12'

In [117]:
df_csv

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-12
1  A01  여성  191436  2023-12
2  A31  남성     319  2023-12
3  A31  여성      42  2023-12
4  A18  남성  158912  2023-12
5  A18  여성  232943  2023-12

In [118]:
df_csv.loc[0] # 데이터 프레임

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-12
1  A01  여성  191436  2023-12
2  A31  남성     319  2023-12

In [119]:
## 데이터프레임 조회(행 연속)
df.loc[0:3]

    이름  나이  주소            이메일  휴대폰
0  ㅇㅇㅇ  20  ㅁㅁ  ㅇㅇㅇ@naver.com  010
1  ㅂㅂㅂ  30  ㅋㅋ  ㅂㅂㅂ@naver.com   02
3  ㄷㄷㄷ  25  ㄹㄹ  ㄷㄷㄷ@naver.com  051

In [120]:
## 필터링
condition = (df_csv['국적코드']=='A31')
condition

0    False
1    False
2     True
3     True
4    False
5    False
Name: 국적코드, dtype: bool

In [121]:
# '국적코드가 A31인 행만 보여줘' 필터링
df_csv[condition]

  국적코드  성별  입국객수     기준년월
2  A31  남성   319  2023-12
3  A31  여성    42  2023-12

In [122]:
# 상단의 condition 변수를 만드는 부분과 사용하는 부분을 합칠 수 있음
df_csv[df_csv['성별']=='여성']

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2023-12
3  A31  여성      42  2023-12
5  A18  여성  232943  2023-12

In [124]:
# 입국객수가 20만 이상인 보여줘
df_csv[df_csv['입국객수'] >= 200_000]

  국적코드  성별    입국객수     기준년월
5  A18  여성  232943  2023-12

In [126]:
## 여러조건을 같이 필터링
df_csv[(df_csv['성별']=='남성') & (df_csv['입국객수'] >= 150_000)]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2023-12

In [128]:
## 한 열에 여러값으로 필터링
df_csv[df_csv['국적코드'].isin(['A01','A31']) == True]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2023-12
1  A01  여성  191436  2023-12
2  A31  남성     319  2023-12
3  A31  여성      42  2023-12

In [130]:
## 한 열에 여러값으로 필터링
df_csv[df_csv['국적코드'].isin(['A01','A31']) == False]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2023-12
5  A18  여성  232943  2023-12

In [132]:
# df에 새 컬럼 생성
df_csv['국적명'] = ['일본','일본','괌','괌','중국','중국']
df_csv

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2023-12  일본
1  A01  여성  191436  2023-12  일본
2  A31  남성     319  2023-12   괌
3  A31  여성      42  2023-12   괌
4  A18  남성  158912  2023-12  중국
5  A18  여성  232943  2023-12  중국

In [137]:
## df에 인덱스 변경
df_csv = df_csv.set_index(keys='국적명')

In [139]:
df_csv

    국적코드  성별    입국객수     기준년월
국적명
일본   A01  남성  106320  2023-12
일본   A01  여성  191436  2023-12
괌    A31  남성     319  2023-12
괌    A31  여성      42  2023-12
중국   A18  남성  158912  2023-12
중국   A18  여성  232943  2023-12

In [140]:
df_csv = df_csv.reset_index()
df_csv

  국적명 국적코드  성별    입국객수     기준년월
0  일본  A01  남성  106320  2023-12
1  일본  A01  여성  191436  2023-12
2   괌  A31  남성     319  2023-12
3   괌  A31  여성      42  2023-12
4  중국  A18  남성  158912  2023-12
5  중국  A18  여성  232943  2023-12

In [ ]:
df_csv.drop('index', axis=1, inplace=True)

In [147]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적명     6 non-null      object
 1   국적코드    6 non-null      object
 2   성별      6 non-null      object
 3   입국객수    6 non-null      int64
 4   기준년월    6 non-null      object
dtypes: int64(1), object(4)
memory usage: 372.0+ bytes

In [144]:
df_csv.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [142]:
## 그룹화(Grouping)는 groupby() 함수만으로 사용불가
## 여러 함수를 같이 사용해야 df로 출력가능
df_csv.groupby('국적명').count()

     국적코드  성별  입국객수  기준년월
국적명
괌       2   2     2     2
일본      2   2     2     2
중국      2   2     2     2

In [148]:
# 나머지 칼럼은 sum() 함수만으로 사용불가
# df에서 Dtype이 'int' 나 'float' 같은 수치형만 통계내는 의미가 있음
df_csv.groupby('국적명').sum('입국객수')

       입국객수
국적명
괌       361
일본   297756
중국   391855

In [150]:
## 그룹화 후 통계함수 사용 시 동일하게 적용
## median(중앙값), min(최솟값), max(최댓값), std(표준편차), var(분산) 등등
df_csv.groupby('국적명').mean('입국객수')

         입국객수
국적명
괌       180.5
일본   148878.0
중국   195927.5

In [151]:
## 오름차순 정렬 
df_csv.sort_values('입국객수')

  국적명 국적코드  성별    입국객수     기준년월
3   괌  A31  여성      42  2023-12
2   괌  A31  남성     319  2023-12
0  일본  A01  남성  106320  2023-12
4  중국  A18  남성  158912  2023-12
1  일본  A01  여성  191436  2023-12
5  중국  A18  여성  232943  2023-12

In [152]:
# 내림차순 정렬
df_csv.sort_values('입국객수',ascending=False)

  국적명 국적코드  성별    입국객수     기준년월
5  중국  A18  여성  232943  2023-12
1  일본  A01  여성  191436  2023-12
4  중국  A18  남성  158912  2023-12
0  일본  A01  남성  106320  2023-12
2   괌  A31  남성     319  2023-12
3   괌  A31  여성      42  2023-12